# vim: set ft=dosini nospell:
# managed by [antidote](https://github.com/mattmc3/antidote)
# compiles to ./.zsh_plugins.zsh by ./.zshrc antidote setup

mattmc3/ez-compinit # queues compinit. Must be first!
getantidote/use-omz # antibody-friendly helper to improve integration with zsh
# romkatv/zsh-defer kind:fpath path:zsh-defer.plugin.zsh # defer loading of zsh plugins. Not necessary with P10k instant prompt.

# belak/zsh-utils path:prompt
# chitoku-k/fzf-zsh-completions # Add zsh fzf completions for git, kubectl, and more e.g. `git rebase -i **<tab>`. Slow - most expensive plugin.
# dim-an/cod kind:clone # tries to call bash completion, doesn't work well with arm64
# djui/alias-tips # tell you when an alias would shorten the command you ran
# hlissner/zsh-autopair # auto close parens, etc. (this is a pain in the ass - sometimes you don't want to close a bracket or paren)
# jeffreytse/zsh-vi-mode # breaks history search via fzf
# marlonrichert/zsh-autocomplete branch:main # automatically show flags/options completion (this plugin is really janky)
# marzocchi/zsh-notify # notify when a command fails or lasts longer than 30 seconds and the terminal is in the background (requires terminal-notifier and reattach-to-user-namespace from within tmux) (same functionality as ntfy)
# mattmc3/zfunctions # define and save functions to separate files. Apparently this is popular. Lazy load functions, define them in the shell then save them, and define help text for them.
# mfaerevaag/wd # warp directory
# ohmyzsh/ohmyzsh path:plugins/alias-finder # supposed to be 10x faster than alias-tips O_O https://github.com/djui/alias-tips/issues/49#issuecomment-569726313
# ohmyzsh/ohmyzsh path:plugins/colored-man-pages
# ohmyzsh/ohmyzsh path:plugins/colorize # Plugin for highlighting file content
# ohmyzsh/ohmyzsh path:plugins/per-directory-history # press <c-g> to toggle between local and global history
# oldratlee/hacker-quotes # just add some cool hacker quotes in shell init like MOTD
# olets/zsh-abbr # define abbreviations that expand as you type
# paulmelnikow/zsh-startup-timer # uncomment to show startup time. This plugin itself is slow, but helpful to measure once in a while.
# qoomon/zsh-lazyload # lazyload various commands (broken)
# sei40kr/fast-alias-tips-bin branch:v0.1.1 (doesn't work - he doesn't put the executable on a branch, it's in a release, which antibody doesn't know how to get)
# sei40kr/zsh-fast-alias-tips (this does not play nice with antibody)
# zdharma-continuum/zsh-startify # like vim-startify for zsh (neat, but doesn't really help)
# zsh-users/zsh-history-substring-search # up arrow after typing part of command (not needed with fzf reverse i-search)
# zsh-users/zsh-syntax-highlighting # colored input... replaced with fast-syntax-highlighting below
Aloxaf/fzf-tab # use FZF for ZSH completion menu
# belak/zsh-utils path:editor
# belak/zsh-utils path:history
# belak/zsh-utils path:utility
# junegunn/fzf-git.sh # fzf git helper <c-g><c-f>, etc.
mroth/evalcache # speeds up subsequent runs of eval init functions. if you make a change just call `_evalcache_clear`.
ohmyzsh/ohmyzsh path:lib/functions.zsh # some dependencies for oh-my-zsh plugins
# ohmyzsh/ohmyzsh path:plugins/command-not-found # suggest packages to install if command not found
# ohmyzsh/ohmyzsh path:plugins/gitfast # fix git completion issues https://unix.stackexchange.com/a/204308 downside: this also adds a TON of gxx aliases https://github.com/ohmyzsh/ohmyzsh/tree/master/plugins/gitfast it also adds MORE git aliases and functions from the main git plugin https://github.com/ohmyzsh/ohmyzsh/blob/master/plugins/git/git.plugin.zsh
# ohmyzsh/ohmyzsh path:plugins/jira # simple command-line tool that just opens jira on different pages. No fancy shit.
ohmyzsh/ohmyzsh path:plugins/vi-mode # switched to zsh-vi-mode... then switched back due to probs
ohmyzsh/ohmyzsh path:plugins/wd/wd.plugin.zsh # warp directory
romkatv/powerlevel10k kind:fpath # zsh prompt theme (see ~/.p10k.zsh)
# yous/vanilli.sh # sensible zsh defaults
zdharma-continuum/fast-syntax-highlighting kind:defer # colored input but faster
zsh-users/zsh-autosuggestions kind:defer # OLD COMMENT: buggy if enabled along with zsh-syntax-highlighting. crashes the shell regularly.
zsh-users/zsh-completions kind:fpath path:src # do-everything argument completions
