# vim: set ft=dosini:
# dim-an/cod kind:clone # tries to call bash completion, doesn't work well with arm64
# djui/alias-tips # tell you when an alias would shorten the command you ran
# marlonrichert/zsh-autocomplete branch:main # automatically show flags/options completion (this plugin is really janky)
# mfaerevaag/wd # warp directory
# oldratlee/hacker-quotes # just add some cool hacker quotes in shell init like MOTD
# paulmelnikow/zsh-startup-timer # uncomment to show startup time. This plugin itself is slow, but helpful to measure once in a while.
# qoomon/zsh-lazyload # lazyload various commands (broken)
# sei40kr/fast-alias-tips-bin branch:v0.1.1 (doesn't work - he doesn't put the executable on a branch, it's in a release, which antibody doesn't know how to get)
# sei40kr/zsh-fast-alias-tips (this does not play nice with antibody)
# zdharma-continuum/zsh-startify # like vim-startify for zsh (neat, but doesn't really help)
# zsh-users/zsh-history-substring-search # up arrow after typing part of command (not needed with fzf reverse i-search)
# zsh-users/zsh-syntax-highlighting # colored input... replaced with fast-syntax-highlighting below
hlissner/zsh-autopair # auto close parens, etc.
marzocchi/zsh-notify # notify when a command fails or lasts longer than 30 seconds and the terminal is in the background (requires terminal-notifier and reattach-to-user-namespace from within tmux) (same functionality as ntfy)
mroth/evalcache # speeds up subsequent runs of eval init functions. if you make a change just call `_evalcache_clear`.
robbyrussell/oh-my-zsh path:lib/functions.zsh # some dependencies for oh-my-zsh plugins
robbyrussell/oh-my-zsh path:plugins/alias-finder # supposed to be 10x faster than alias-tips O_O https://github.com/djui/alias-tips/issues/49#issuecomment-569726313
robbyrussell/oh-my-zsh path:plugins/colored-man-pages
robbyrussell/oh-my-zsh path:plugins/colorize # Plugin for highlighting file content
robbyrussell/oh-my-zsh path:plugins/command-not-found # suggest packages to install if command not found
robbyrussell/oh-my-zsh path:plugins/gitfast # fix git completion issues https://unix.stackexchange.com/a/204308 downside: this also adds a TON of gxx aliases https://github.com/robbyrussell/oh-my-zsh/tree/master/plugins/gitfast it also adds MORE git aliases and functions from the main git plugin https://github.com/robbyrussell/oh-my-zsh/blob/master/plugins/git/git.plugin.zsh
robbyrussell/oh-my-zsh path:plugins/jira # simple command-line tool that just opens jira on different pages. No fancy shit.
robbyrussell/oh-my-zsh path:plugins/vi-mode
robbyrussell/oh-my-zsh path:plugins/wd/wd.plugin.zsh # warp directory
romkatv/powerlevel10k # zsh prompt theme (see ~/.p10k.zsh)
yous/vanilli.sh # sensible zsh defaults
zdharma-continuum/fast-syntax-highlighting # colored input but faster
zsh-users/zsh-autosuggestions # OLD COMMENT: buggy if enabled along with zsh-syntax-highlighting. crashes the shell regularly.
zsh-users/zsh-completions # do-everything argument completions
